In [1]:
import pandas as pd
import json
from scipy import stats
import numpy as np

# 이벤트 기간에 참여한 유저

### 가입 전체 유저

# reward_pay_1.0_all_user.csv 산출 쿼리

select date_format(u.join_date, '%Y-%m-%d') as join_date, u.id as uid
from user u
where date_format(u.join_date, '%Y-%m-%d') in ('2019-12-17', '2019-12-18', '2019-12-19')

In [3]:
read_path = '../csv/reward_pay_1.0_all_user.csv'
all_user = pd.read_csv(read_path)

all_user['uid'] = all_user['uid'].astype(str)

all_user

        join_date       uid
0      2019-12-17  10456692
1      2019-12-17  10456693
2      2019-12-17  10456694
3      2019-12-17  10456695
4      2019-12-17  10456696
...           ...       ...
16375  2019-12-19  10473808
16376  2019-12-19  10473809
16377  2019-12-19  10473810
16378  2019-12-19  10473811
16379  2019-12-19  10473812

[16380 rows x 2 columns]

In [7]:
all_user.groupby(['join_date'], as_index=False).agg({'uid': 'count'})

    join_date   uid
0  2019-12-17  5785
1  2019-12-18  5483
2  2019-12-19  5112

### 이벤트 대상 유저

In [4]:
read_path = '../csv/reward_pay_1.0_target_user.csv'
target_user = pd.read_csv(read_path)

target_user = target_user[(target_user['memo'] == 'group_1') | (target_user['memo'] == 'group_2') |
                         (target_user['memo'] == 'group_3') | (target_user['memo'] == 'group_4')] 

target_user = target_user.rename(columns={'target_uid': 'uid', 'memo': 'test_group'})

target_user = target_user[['event_date', 'uid', 'test_group']]

target_user['uid'] = target_user['uid'].astype(str)

target_user

      event_date       uid test_group
0     2019-12-18  10456697    group_2
1     2019-12-18  10456699    group_4
2     2019-12-18  10456707    group_4
3     2019-12-18  10456712    group_1
4     2019-12-18  10456713    group_2
...          ...       ...        ...
3943  2019-12-20  10473793    group_2
3944  2019-12-20  10473798    group_3
3945  2019-12-20  10473802    group_3
3946  2019-12-20  10473803    group_4
3947  2019-12-20  10473810    group_3

[3940 rows x 3 columns]

### 전체 가입 유저와 이벤트 대상 유저 merge

In [6]:
user = pd.merge(all_user, target_user, on='uid', how='left')

def group_reward(row):
    if row['test_group'] == 'group_1':
        return '1000'
    elif row['test_group'] == 'group_2':
        return '2000'
    elif row['test_group'] == 'group_3':
        return '3000'
    elif row['test_group'] == 'group_4':
        return '4000'
    else:
        return '0'

user['reward'] = user.apply(group_reward, axis=1)
    
user

        join_date       uid  event_date test_group reward
0      2019-12-17  10456692         NaN        NaN      0
1      2019-12-17  10456693         NaN        NaN      0
2      2019-12-17  10456694         NaN        NaN      0
3      2019-12-17  10456695         NaN        NaN      0
4      2019-12-17  10456696         NaN        NaN      0
...           ...       ...         ...        ...    ...
16375  2019-12-19  10473808         NaN        NaN      0
16376  2019-12-19  10473809         NaN        NaN      0
16377  2019-12-19  10473810  2019-12-20    group_3   3000
16378  2019-12-19  10473811         NaN        NaN      0
16379  2019-12-19  10473812         NaN        NaN      0

[16380 rows x 5 columns]